Ran Plan for 5 projects:

1. project: `crawlinghub-ecr-prod` dir: `terraform/ecr` workspace: `default`
1. project: `crawlinghub-ecs-cluster-prod` dir: `terraform/ecs-cluster` workspace: `default`
1. project: `crawlinghub-elasticache-prod` dir: `terraform/elasticache` workspace: `default`
1. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
1. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
---

### 1. project: `crawlinghub-ecr-prod` dir: `terraform/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.ecr_scheduler.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.ecr_web_api.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.scheduler will be destroyed
  # (because aws_ecr_lifecycle_policy.scheduler is not in configuration)
- resource "aws_ecr_lifecycle_policy" "scheduler" {
      - id          = "crawlinghub-scheduler-prod" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep last 30 tagged images"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber   = 30
                          - countType     = "imageCountMoreThan"
                          - tagPrefixList = [
                              - "v",
                              - "prod",
                              - "latest",
                            ]
                          - tagStatus     = "tagged"
                        }
                    },
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Delete untagged images older than 7 days"
                      - rulePriority = 2
                      - selection    = {
                          - countNumber = 7
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "646886795421" -> null
      - repository  = "crawlinghub-scheduler-prod" -> null
    }

  # aws_ecr_lifecycle_policy.web_api will be destroyed
  # (because aws_ecr_lifecycle_policy.web_api is not in configuration)
- resource "aws_ecr_lifecycle_policy" "web_api" {
      - id          = "crawlinghub-web-api-prod" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep last 30 tagged images"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber   = 30
                          - countType     = "imageCountMoreThan"
                          - tagPrefixList = [
                              - "v",
                              - "prod",
                              - "latest",
                            ]
                          - tagStatus     = "tagged"
                        }
                    },
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Delete untagged images older than 7 days"
                      - rulePriority = 2
                      - selection    = {
                          - countNumber = 7
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "646886795421" -> null
      - repository  = "crawlinghub-web-api-prod" -> null
    }

  # aws_ecr_repository.scheduler will be destroyed
  # (because aws_ecr_repository.scheduler is not in configuration)
- resource "aws_ecr_repository" "scheduler" {
      - arn                  = "arn:aws:ecr:ap-northeast-2:646886795421:repository/crawlinghub-scheduler-prod" -> null
      - id                   = "crawlinghub-scheduler-prod" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "crawlinghub-scheduler-prod" -> null
      - registry_id          = "646886795421" -> null
      - repository_url       = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/crawlinghub-scheduler-prod" -> null
      - tags                 = {
          - "Environment" = "prod"
          - "Service"     = "crawlinghub-scheduler-prod"
        } -> null
      - tags_all             = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "crawlinghub"
          - "Service"     = "crawlinghub-scheduler-prod"
        } -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_ecr_repository.web_api will be destroyed
  # (because aws_ecr_repository.web_api is not in configuration)
- resource "aws_ecr_repository" "web_api" {
      - arn                  = "arn:aws:ecr:ap-northeast-2:646886795421:repository/crawlinghub-web-api-prod" -> null
      - id                   = "crawlinghub-web-api-prod" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "crawlinghub-web-api-prod" -> null
      - registry_id          = "646886795421" -> null
      - repository_url       = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/crawlinghub-web-api-prod" -> null
      - tags                 = {
          - "Environment" = "prod"
          - "Service"     = "crawlinghub-web-api-prod"
        } -> null
      - tags_all             = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "crawlinghub"
          - "Service"     = "crawlinghub-web-api-prod"
        } -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # module.ecr_scheduler.aws_ecr_lifecycle_policy.this[0] will be created
+ resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "crawlinghub-scheduler-prod"
    }

  # module.ecr_scheduler.aws_ecr_repository.this will be created
+ resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "crawlinghub-scheduler-prod"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-crawlinghub-scheduler-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "crawlinghub-scheduler"
        }
      + tags_all             = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-crawlinghub-scheduler-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "crawlinghub-scheduler"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_scheduler.aws_ecr_repository_policy.default[0] will be created
+ resource "aws_ecr_repository_policy" "default" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Sid       = "AllowPushPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "crawlinghub-scheduler-prod"
    }

  # module.ecr_scheduler.aws_ssm_parameter.repository-url[0] will be created
+ resource "aws_ssm_parameter" "repository-url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ECR repository URL for crawlinghub-scheduler-prod"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/ecr/crawlinghub-scheduler-prod-repository-url"
      + tags           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "crawlinghub-scheduler"
        }
      + tags_all       = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "crawlinghub-scheduler"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ecr_web_api.aws_ecr_lifecycle_policy.this[0] will be created
+ resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "crawlinghub-web-api-prod"
    }

  # module.ecr_web_api.aws_ecr_repository.this will be created
+ resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "crawlinghub-web-api-prod"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-crawlinghub-web-api-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all             = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-crawlinghub-web-api-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "crawlinghub-web-api"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_web_api.aws_ecr_repository_policy.default[0] will be created
+ resource "aws_ecr_repository_policy" "default" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Sid       = "AllowPushPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "crawlinghub-web-api-prod"
    }

  # module.ecr_web_api.aws_ssm_parameter.repository-url[0] will be created
+ resource "aws_ssm_parameter" "repository-url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ECR repository URL for crawlinghub-web-api-prod"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/ecr/crawlinghub-web-api-prod-repository-url"
      + tags           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all       = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "crawlinghub-web-api"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 8 to add, 0 to change, 4 to destroy.

Changes to Outputs:
~ scheduler_repository_arn = "arn:aws:ecr:ap-northeast-2:646886795421:repository/crawlinghub-scheduler-prod" -> (known after apply)
~ scheduler_repository_url = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/crawlinghub-scheduler-prod" -> (known after apply)
~ web_api_repository_arn   = "arn:aws:ecr:ap-northeast-2:646886795421:repository/crawlinghub-web-api-prod" -> (known after apply)
~ web_api_repository_url   = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/crawlinghub-web-api-prod" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-ecr-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-ecr-prod
  ```
Plan: 8 to add, 0 to change, 4 to destroy.

---
### 2. project: `crawlinghub-ecs-cluster-prod` dir: `terraform/ecs-cluster` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-ecs-cluster-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecs-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-ecs-cluster-prod
  ```

---
### 3. project: `crawlinghub-elasticache-prod` dir: `terraform/elasticache` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-elasticache-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Felasticache%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-elasticache-prod
  ```

---
### 4. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.web_api will be destroyed
  # (because aws_cloudwatch_log_group.web_api is not in configuration)
- resource "aws_cloudwatch_log_group" "web_api" {
      - arn               = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/crawlinghub-web-api-prod" -> null
      - id                = "/ecs/crawlinghub-web-api-prod" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/crawlinghub-web-api-prod" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "prod"
          - "Service"     = "crawlinghub-web-api-prod"
        } -> null
      - tags_all          = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "crawlinghub"
          - "Service"     = "crawlinghub-web-api-prod"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_ecs_service.web_api will be updated in-place
~ resource "aws_ecs_service" "web_api" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/crawlinghub-cluster-prod/crawlinghub-web-api-prod"
        name                               = "crawlinghub-web-api-prod"
        tags                               = {
            "Environment" = "prod"
            "Service"     = "crawlinghub-web-api-prod"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:24" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.web_api must be replaced
-/+ resource "aws_ecs_task_definition" "web_api" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:25" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "crawlinghub-web-api-prod" -> (known after apply)
      ~ revision                 = 25 -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "Service"     = "crawlinghub-web-api-prod"
        }
        # (12 unchanged attributes hidden)
    }

  # module.web_api_logs.aws_cloudwatch_log_group.this will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/crawlinghub-web-api-prod/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Component"     = "log-group"
          + "CostCenter"    = "engineering"
          + "DataClass"     = "confidential"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "false"
          + "LangfuseSync"  = "disabled"
          + "Lifecycle"     = "production"
          + "LogType"       = "application"
          + "ManagedBy"     = "terraform"
          + "Name"          = "/aws/ecs/crawlinghub-web-api-prod/application"
          + "Owner"         = "platform@ryuqqq.com"
          + "Project"       = "infrastructure"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "crawlinghub-web-api"
        }
      + tags_all          = {
          + "Component"     = "log-group"
          + "CostCenter"    = "engineering"
          + "DataClass"     = "confidential"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "false"
          + "LangfuseSync"  = "disabled"
          + "Lifecycle"     = "production"
          + "LogType"       = "application"
          + "ManagedBy"     = "terraform"
          + "Name"          = "/aws/ecs/crawlinghub-web-api-prod/application"
          + "Owner"         = "platform@ryuqqq.com"
          + "Project"       = "infrastructure"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "crawlinghub-web-api"
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-ecs-web-api-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-ecs-web-api-prod
  ```
Plan: 2 to add, 1 to change, 2 to destroy.

---
### 5. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.scheduler will be destroyed
  # (because aws_cloudwatch_log_group.scheduler is not in configuration)
- resource "aws_cloudwatch_log_group" "scheduler" {
      - arn               = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/crawlinghub-scheduler-prod" -> null
      - id                = "/ecs/crawlinghub-scheduler-prod" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/crawlinghub-scheduler-prod" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "prod"
          - "Service"     = "crawlinghub-scheduler-prod"
        } -> null
      - tags_all          = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "crawlinghub"
          - "Service"     = "crawlinghub-scheduler-prod"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.scheduler must be replaced
-/+ resource "aws_ecs_task_definition" "scheduler" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod:12" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "crawlinghub-scheduler-prod" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "Service"     = "crawlinghub-scheduler-prod"
        }
        # (12 unchanged attributes hidden)
    }

  # module.scheduler_logs.aws_cloudwatch_log_group.this will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/crawlinghub-scheduler-prod/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Component"     = "log-group"
          + "CostCenter"    = "engineering"
          + "DataClass"     = "confidential"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "false"
          + "LangfuseSync"  = "disabled"
          + "Lifecycle"     = "production"
          + "LogType"       = "application"
          + "ManagedBy"     = "terraform"
          + "Name"          = "/aws/ecs/crawlinghub-scheduler-prod/application"
          + "Owner"         = "platform@ryuqqq.com"
          + "Project"       = "infrastructure"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "crawlinghub-scheduler"
        }
      + tags_all          = {
          + "Component"     = "log-group"
          + "CostCenter"    = "engineering"
          + "DataClass"     = "confidential"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "false"
          + "LangfuseSync"  = "disabled"
          + "Lifecycle"     = "production"
          + "LogType"       = "application"
          + "ManagedBy"     = "terraform"
          + "Name"          = "/aws/ecs/crawlinghub-scheduler-prod/application"
          + "Owner"         = "platform@ryuqqq.com"
          + "Project"       = "infrastructure"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "crawlinghub-scheduler"
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
~ log_group_name      = "/ecs/crawlinghub-scheduler-prod" -> "/aws/ecs/crawlinghub-scheduler-prod/application"
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod:12" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-ecs-scheduler-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecs-scheduler%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-ecs-scheduler-prod
  ```
Plan: 2 to add, 0 to change, 2 to destroy.

---
### Plan Summary

5 projects, 3 with changes, 2 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```